kOmega/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topInlet
    {
        type fixedValue; 
        value uniform (19.97259 -1.0467 0); 
    }

    bottomInlet
    {
        type fixedValue; 
        value uniform (19.97259 1.0467 0); 
    }

    outlet
    {
        type zeroGradient; 
    }

    walls
    {
        type noSlip; 
    }

    reflecting
    {
        type zeroGradient; 
    }

    frontBack
    {
        type empty; 
    }
}

// ************************************************************************* //
