kOmega/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    topInlet
    {
        type fixedValue; 
        value uniform .375; 
    }

    bottomInlet
    {
        type fixedValue; 
        value uniform .375; 
    }

    outlet
    {
        type zeroGradient; 
    }

    walls
    {
        type kqRWallFunction;
        value uniform .375;  
    }

    reflecting
    {
        type zeroGradient; 
    }

    frontBack
    {
        type empty; 
    }
}


// ************************************************************************* //
